class Governorate {
  String gov;
  List<String> cities;
  List<Governorate> egyptGovernorates = new List<Governorate>();

  Governorate(String gov, List<String> cities) {
    this.gov = gov;
    this.cities = (cities);
  }

  Governorate.init() {
    initialzeGovernorates();
  }

  List<String> getGovernorates() {
    List<String> governorates = new List<String>();
    for (int i = 0; i < egyptGovernorates.length; i++) {
      governorates.add(egyptGovernorates[i].gov);
    }
    return governorates;
  }

  void initialzeGovernorates() {
    egyptGovernorates.addAll([
      new Governorate(
          "محافظة أسوان", ["أسوان", "دراو", "كوم أمبو", "نصر النوبة", "إدفو"]),
      new Governorate("محافظة أسيوط", [
        "ديروط",
        "القوصية",
        "أبنوب",
        "منفلوط",
        "أسيوط",
        "الفتح",
        "أبو تيج",
        "الغنايم",
        "ساحل سليم",
        "البداري",
        "صدفا"
      ]),
      new Governorate("محافظة الأقصر", [
        "الأقصر",
        "الأقصر الجديدة",
        "طيبة الجديدة",
        "الزينية",
        "البياضية",
        "القرنة",
        "أرمنت",
        "الطود",
        "إسنا"
      ]),
      new Governorate("محافظة الإسكندرية",
          ["الإسكندرية", "برج العرب الجديدة", "برج العرب"]),
      new Governorate("محافظة الإسماعيلية", [
        "الإسماعيلية",
        "التل الكبير",
        "فايد",
        "القنطرة شرق",
        "القنطرة غرب",
        "أبوصوير",
        "القصاصين"
      ]),
      new Governorate("محافظة البحر الأحمر", [
        "رأس غارب",
        "الغردقة",
        "القصير",
        "سفاجا",
        "مرسى علم",
        "شلاتين",
        "حلايب"
      ]),
      new Governorate("محافظة البحيرة", [
        "رشيد ",
        "شبراخيت ",
        "ايتاي البارود",
        "أبو حمص",
        "حوش عيسى",
        "كفر الدوار",
        "الدلنجات",
        "كوم حمادة",
        "دمنهور",
        "المحمودية",
        "إدكو",
        "أبو المطامير",
        "الرحمانية",
        "النوبارية الجديدة",
        "وادي النطرون",
        "بدر"
      ]),
      new Governorate("محافظة الجيزة", [
        "الجيزة",
        "منشأة القناطر",
        "أوسيم",
        "كرداسة",
        "أبو النمرس",
        "الحوامدية",
        "البدرشين",
        "العياط",
        "الصف",
        "أطفيح",
        "الواحات البحرية"
      ]),
      new Governorate("محافظة الدقهلية", [
        "المنصورة",
        "المنزلة",
        "الجمالية",
        "دكرنس",
        "منية النصر",
        "ميت سلسيل",
        "ميت غمر",
        "أجا",
        "طلخا",
        "بلقاس",
        "السنبلاوين",
        "شربين",
        "بني عبيد",
        "تمى الأمديد",
        "المطرية",
        "نبروه",
        "جمصة",
        "الكردي",
        "محلة الدمنة"
      ]),
      new Governorate(
          "محافظة السويس", ["السويس", "الأربعين", "عتاقة", "الجناين", "فيصل"]),
      new Governorate("محافظة الشرقية", [
        "الزقازيق",
        "الحسينية",
        "فاقوس",
        "بلبيس",
        "منيا القمح",
        "أبو حماد",
        "اولاد صقر",
        "العاشر من رمضان",
        "الصالحية الجديدة",
        "كفر صقر",
        "أبو كبير",
        "القنايات",
        "مشتول السوق",
        "ديرب نجم",
        "الإبراهيمية",
        "ههيا",
        "القرين",
        "صان الحجر",
        "العزيزية"
      ]),
      new Governorate("محافظة الغربية", [
        "كفر الزيات",
        "السنطة",
        "المحلة الكبرى",
        "بسيون",
        "زفتى",
        "سمنود",
        "طنطا",
        "قطور"
      ]),
      new Governorate("محافظة الفيوم",
          ["الفيوم", "سنورس", "ابشواى", "اطسا", "طامية", "يوسف الصديق"]),
      new Governorate("محافظة القاهرة", [
        "المرج",
        "المطرية",
        "عين شمس",
        "السلام أول",
        "السلام ثان",
        "النزهة",
        "مصر الجديدة",
        "شرق نصر",
        "غرب نصر",
        "منشأة ناصر",
        "الوايلي",
        "باب الشعرية",
        "وسط",
        "الموسكى",
        "الأزبكية",
        "عابدين",
        "بولاق",
        "غرب",
        "الزيتون",
        "حدائق القبة",
        "الزاوية الحمراء",
        "الشرابية",
        "الساحل",
        "شبرا",
        "روض الفرج",
        "السيدة زينب",
        "مصر القديمة",
        "الخليفة",
        "المقطم",
        "البساتين",
        "دار السلام",
        "المعادي",
        " طرة",
        "حلوان",
        "التبين",
        "15 مايو"
      ]),
      new Governorate("محافظة القليوبية", [
        "بنها",
        "قليوب",
        "القناطر الخيرية",
        "شبرا الخيمة",
        "الخانكة",
        "كفر شكر",
        "شبين القناطر",
        "طوخ",
        "العبور",
        "قها",
        "الخصوص"
      ]),
      new Governorate("محافظة المنوفية", [
        "شبين الكوم",
        "قويسنا",
        "منوف",
        "الباجور",
        "تلا",
        "بركة السبع",
        "الشهداء ",
        "أشمون",
        "السادات"
      ]),
      new Governorate("محافظة المنيا", [
        "مغاغة",
        "بني مزار",
        "مطاي",
        "سمالوط",
        "المنيا",
        "أبو قرقاص",
        "ملوي",
        "دير مواس",
        "العدوة"
      ]),
      new Governorate("محافظة الوادي الجديد",
          ["الخارجة", "باريس", "بلاط", "الداخلة", "الفرافرة", "موط"]),
      new Governorate("محافظة بني سويف",
          ["الفشن", "الواسطي", "أهناسيا", "سمسطا", "ببا", "بنى سويف", "ناصر"]),
      new Governorate("محافظة بورسعيد", ["بورسعيد", "بور فؤاد"]),
      new Governorate("محافظة جنوب سيناء", [
        "أبو رديس",
        "أبو زنيمة",
        "نويبع",
        "طابا",
        "رأس سدر",
        "دهب",
        "شرم الشيخ",
        "سانت كاترين",
        "الطور"
      ]),
      new Governorate("محافظة دمياط", [
        "دمياط",
        "فارسكور",
        "كفر سعد",
        "الزرقا",
        "كفر البطيخ",
        "دمياط الجديدة"
      ]),
      new Governorate("محافظة سوهاج", [
        "ساقلتة",
        "أخميم",
        "البلينا",
        "جرجا",
        "دارالسلام",
        "جهينة",
        "سوهاج",
        "طما",
        "طهطا",
        "المراغة",
        "المنشاة",
        "العسيرات"
      ]),
      new Governorate("محافظة شمال سيناء",
          ["بئر العبد", "نخل", "الحسنة", "العريش", "الشيخ زويد", "رفح"]),
      new Governorate("محافظة قنا", [
        "أبو تشت",
        "فرشوط",
        "نجع حمادي",
        "الوقف",
        "دشنا",
        "قنا",
        "قفط",
        "قوص",
        "نقادة"
      ]),
      new Governorate("محافظة كفر الشيخ", [
        "كفر الشيخ",
        "دسوق",
        "فوّه",
        "مطوبس",
        "قلين",
        "سيدي سالِم",
        "الرياض",
        "بيلا",
        "الحامول",
        "البرلس"
      ]),
      new Governorate("محافظة مطروح", [
        "الحمام",
        "العلمين",
        "الضبعة",
        "مرسى مطروح",
        "النجيلة",
        "براني",
        "السلوم",
        "سيوة"
      ]),
    ]);
  }
}
